{
  "02_01": "CSS stands for Cascading Style Sheets, which is used to control the appearance and layout of web pages.",
  "02_02": "External CSS files are linked within the <head> to ensure styles are loaded before the page renders.",
  "02_03": "The <link> tag connects external CSS files to your HTML document.",
  "02_04": "The color property changes the color of the text in an element.",
  "02_05": "Using p { ... } selects all <p> elements for styling.",
  "02_06": "#main selects the element with the id 'main' in CSS.",
  "02_07": ".container targets all elements with the class 'container'.",
  "02_08": "background-color is the property used to set the background color of an element.",
  "02_09": "The default value of position is static, meaning the element is positioned according to the normal document flow.",
  "02_10": "font-size changes the size of text in an element.",
  "02_11": "padding creates space between an element's content and its border.",
  "02_12": "margin adds space outside the border of an element, separating it from others.",
  "02_13": "visibility: hidden hides an element but it still takes up space in the layout.",
  "02_14": "font-style: italic; makes the text italicized.",
  "02_15": "em is relative to the font size of the parent element, allowing flexible scaling.",
  "02_16": "rem is relative to the root element's font size, ensuring consistent scaling across the page.",
  "02_17": "* is the universal selector that matches every element.",
  "02_18": "div > p selects only <p> elements that are direct children of a <div>.",
  "02_19": ":hover applies styles when the user places their mouse over the element.",
  "02_20": "line-height controls the vertical spacing between lines of text.",
  "02_21": "font-weight sets how bold or light text should appear.",
  "02_22": "text-decoration: underline; underlines the text within the element.",
  "02_23": "border-radius rounds the corners of a box element.",
  "02_24": "border-width defines how thick the border around an element is.",
  "02_25": "padding sets the distance from the content to the border of an element.",
  "02_26": "box-shadow creates a drop shadow behind the box of an element.",
  "02_27": "The default display for <span> is inline, meaning it flows with surrounding text.",
  "02_28": "z-index sets the stacking order of overlapping positioned elements.",
  "02_29": "float: right; makes the element float to the right of its container.",
  "02_30": "absolute positioning removes the element from the normal flow, placing it at a specific location.",
  "02_31": "opacity changes how transparent an element is (0 is invisible, 1 is fully visible).",
  "02_32": "position: fixed keeps the element in the same spot on the screen when scrolling.",
  "02_33": "ul li selects all <li> elements that are anywhere inside <ul> elements.",
  "02_34": "nav a selects only <a> links that are descendants of a <nav> element.",
  "02_35": "letter-spacing controls the space between each character in the text.",
  "02_36": "font-family sets the font type for the element.",
  "02_37": "text-align controls the horizontal alignment of text (e.g., left, center, right).",
  "02_38": ":hover is a pseudo-class, used to define a special state of an element.",
  "02_39": "background-image sets an image as the background of an element.",
  "02_40": "display: flex creates a flex container for easy flexible layouts.",
  "02_41": "flex-wrap determines if flex items should wrap to the next line or stay on one line.",
  "02_42": "flex-direction specifies if flex items should be in a row, column, or reversed.",
  "02_43": "justify-content: center aligns flex items horizontally in the center of the container.",
  "02_44": "column-gap sets the gap between columns in a CSS grid layout.",
  "02_45": "column-count divides an element's content into a specified number of columns.",
  "02_46": "@media is used for writing media queries to make sites responsive.",
  "02_47": "overflow: auto only shows scrollbars if the content overflows.",
  "02_48": "content-box is the default box-sizing, meaning width and height include only the content, not padding or border.",
  "02_49": "aria-hidden hides an element from assistive technologies but keeps it visible in the browser.",
  "02_50": "z-index controls which overlapping element appears on top.",
  "02_51": "Margin is outside the border; padding is inside. Both are used for spacing.",
  "02_52": "section .note selects all elements with the class 'note' inside a <section>.",
  "02_53": "width: 100%; makes an element fill the width of its container.",
  "02_54": "cursor changes the appearance of the mouse pointer over an element.",
  "02_55": "inherit forces a property to take the same computed value as its parent.",
  "02_56": "IDs are unique and can only be used once per page, while classes can be reused on multiple elements.",
  "02_57": "CSS comments use /* comment */ syntax.",
  "02_58": "@font-face lets you define and use custom fonts in your site.",
  "02_59": "background-image applies an image as the background of an element.",
  "02_60": "linear-gradient() is used for creating smooth transitions between two or more colors.",
  "02_61": "background-repeat controls whether and how a background image repeats.",
  "02_62": "The box model consists of content, padding, border, and margin, in that order.",
  "02_63": "max-width sets the maximum allowed width for an element.",
  "02_64": "text-transform: uppercase; makes all letters uppercase.",
  "02_65": ":nth-child(odd) selects all odd-numbered children of a parent element.",
  "02_66": "gap creates consistent space between grid (and flex) items.",
  "02_67": "overflow: hidden hides any content that overflows the element's bounds.",
  "02_68": ":first-child selects any element that is the first child of its parent.",
  "02_69": "text-shadow can add multiple shadows to text for depth and effects.",
  "02_70": "CSS variables (custom properties) let you store values (like colors) for reuse throughout your styles.",
  "02_71": "div > p selects <p> elements that are direct children of a <div>.",
  "02_72": "The comma allows you to select multiple different elements with one rule.",
  "02_73": "b + span selects a <span> that immediately follows a <b> element.",
  "02_74": "The ~ selector selects all siblings that come after the first element, not just the next one.",
  "02_75": "@media (min-width: 600px) applies styles when the viewport is at least 600px wide.",
  "02_76": "Media queries let you change your styles for different devices and screen sizes.",
  "02_77": "The 'print' media type applies styles when printing a page.",
  "02_78": "input[type='checkbox'] selects all input elements whose type is checkbox.",
  "02_79": ":first-child targets the first child element of its parent.",
  "02_80": "p::first-line styles only the first line of a paragraph.",
  "02_81": "tr:nth-child(even) selects every even-numbered row in a table.",
  "02_82": "a:hover is the correct way to style a link on hover.",
  "02_83": "rem units scale with the root font size, making layouts more accessible and flexible.",
  "02_84": ":only-child selects elements that are the only child of their parent.",
  "02_85": ".menu > li.active targets <li> elements with the class 'active' that are direct children of .menu.",
  "02_86": "<style> is the correct tag for internal CSS styles.",
  "02_87": "The style attribute is used for inline CSS on HTML elements.",
  "02_88": "text-transform: capitalize; makes the first letter of each word uppercase."
}
