{
  "01_01": "The <a> tag creates a hyperlink, letting users click and navigate to another page or resource.",
  "01_02": "A valid HTML5 document starts with <!DOCTYPE html> and must have <html>, <head>, and <body> tags in this order.",
  "01_03": "<img> is the tag used to embed and display images in a web page.",
  "01_04": "The alt attribute is required for accessibility, so screen readers can describe the image to users who can't see it.",
  "01_05": "<h1> is for the largest (top-level) heading; it's used for main titles.",
  "01_06": "<ul> creates an unordered (bulleted) list.",
  "01_07": "<em> is used to emphasize text, typically displayed in italics and also conveys meaning to assistive technology.",
  "01_08": "<!-- comment --> is the syntax for an HTML comment, which is not shown to users.",
  "01_09": "<br> creates a line break in text, forcing the next content onto a new line.",
  "01_10": "The <title> tag sets the page title in the browser tab and is also used by search engines.",
  "01_11": "src is the attribute that tells the browser where to find the image file for <img>.",
  "01_12": "<tr> defines a table row and must be inside a <table>.",
  "01_13": "<li> is used for each list item inside <ul> or <ol>.",
  "01_14": "<footer> represents the footer section, usually containing copyright or contact info.",
  "01_15": "<h1> defines the most important heading and should be used once per page.",
  "01_16": "<nav> groups navigation links so browsers and assistive technology know it's for site navigation.",
  "01_17": "<audio> is the tag for embedding audio files like music or podcasts in a page.",
  "01_18": "<video> embeds video files in a web page, supporting playback controls and different formats.",
  "01_19": "<pre> preserves formatting and spacing for preformatted text such as code blocks.",
  "01_20": "<input type=\"checkbox\"> is the correct way to make a checkbox for forms.",
  "01_21": "The title attribute provides a tooltip when you hover over the element.",
  "01_22": "<b> makes text bold visually, though <strong> is preferred for semantic meaning.",
  "01_23": "<td> defines a table data cell inside a table row (<tr>).",
  "01_24": "The action attribute in a <form> tells the browser where to send the form's data when submitted.",
  "01_25": "<section> is used to divide content into meaningful sections or topics.",
  "01_26": "<aside> is meant for content only somewhat related to the main content, like sidebars or pull quotes.",
  "01_27": "<fieldset> groups related form controls together and draws a box around them.",
  "01_28": "<select> creates a dropdown menu for users to pick one or more options.",
  "01_29": "<code> is for short fragments of computer code or inline code.",
  "01_30": "<cite> is for citing a reference, such as a book, article, or website.",
  "01_31": "<q> defines a short inline quotation.",
  "01_32": "<meta> provides metadata, such as character encoding and page description, for search engines and browsers.",
  "01_33": "target=\"_blank\" opens a link in a new browser tab or window.",
  "01_34": "An <input> with type=\"date\" shows a calendar picker in most browsers.",
  "01_35": "<nav> should contain navigation links for accessibility and structure.",
  "01_36": "<h1> is always the main heading for the web page.",
  "01_37": "<hr> draws a horizontal line (thematic break) between sections.",
  "01_38": "<span> is for grouping inline elements so you can style or manipulate them with CSS/JS.",
  "01_39": "<aside> is for content that's tangentially related, such as a sidebar.",
  "01_40": "<address> gives contact info for the page author/owner.",
  "01_41": "<code> tags are used to format short code fragments inline.",
  "01_42": "<input> is the base element for all kinds of user input fields in forms.",
  "01_43": "disabled disables a form control so users cannot interact with it.",
  "01_44": "GET is the default HTTP method for form submissions, sending data via the URL.",
  "01_45": "<!-- comment --> is the correct syntax for an HTML comment.",
  "01_46": "<header> marks the heading or introductory section of a page or section.",
  "01_47": "<iframe> is used to embed another HTML page inside the current page.",
  "01_48": "<input type=\"radio\"> creates a radio button to select one option from a group.",
  "01_49": "<nav> is designed for grouping navigation links semantically.",
  "01_50": "<main> wraps the main content unique to the page.",
  "01_51": "<option> defines each selectable choice within a <select> dropdown.",
  "01_52": "<div> is a generic block-level container, good for layout and grouping content.",
  "01_53": "<meta name=\"viewport\"> makes a site responsive by controlling layout on mobile devices.",
  "01_54": "<optgroup> groups related <option> elements within a dropdown for better usability.",
  "01_55": "<ol> creates a numbered (ordered) list.",
  "01_56": "<section> is for standalone sections of content in a document.",
  "01_57": "<th> creates a header cell for a table, usually bold and centered.",
  "01_58": "<abbr> marks up abbreviations and acronyms for accessibility and tooltips.",
  "01_59": "<progress> shows progress of a task (like a loading bar).",
  "01_60": "<input type=\"number\"> provides a numeric input control.",
  "01_61": "<kbd> marks up keyboard input, showing what a user should type.",
  "01_62": "<svg> is used to embed scalable vector graphics directly in HTML.",
  "01_63": "<noscript> defines content shown if JavaScript is disabled or unsupported in the browser.",
  "01_64": "<area> defines a clickable region in an image map for navigation.",
  "01_65": "<meter> displays a scalar measurement within a known range (like a fuel gauge).",
  "01_66": "<div> is a block-level container for grouping elements for styling or scripting.",
  "01_67": "<abbr> allows you to specify a full term and show a tooltip on hover for abbreviations.",
  "01_68": "<ins> is used to mark inserted/added text in a document.",
  "01_69": "<del> shows text that has been removed/deleted from the document.",
  "01_70": "alt provides alternative text for images, which is important for accessibility.",
  "01_71": "<!DOCTYPE html> at the top tells browsers to use the HTML5 standard.",
  "01_72": "<div>, <section>, and <article> are all block-level elements that take up the full width available.",
  "01_73": "<em>, <strong>, and <span> are inline elements, so they only take up as much width as needed and sit within lines of text.",
  "01_74": "The alt attribute describes images for users who can't see them, making pages more accessible.",
  "01_75": "<main> is for the main, unique content on a page (not sidebars or repeated nav).",
  "01_76": "<iframe> lets you embed an entire external page, like a YouTube video or another website.",
  "01_77": "The date input type opens a calendar picker in supporting browsers.",
  "01_78": "tabindex lets users tab to/focus on elements using the keyboard, improving accessibility.",
  "01_79": "Relative paths are based on the current file's location; absolute paths give the full address or start from the root.",
  "01_80": "&nbsp; creates a non-breaking space, which prevents automatic line breaks at its position.",
  "01_81": "<label> links text to a form control, which improves accessibility for screen readers.",
  "01_82": "color, email, and date are all new input types in HTML5 that add built-in validation or controls.",
  "01_83": "<optgroup> groups options inside a dropdown list for better organization.",
  "01_84": "The required attribute prevents form submission until the user completes that field.",
  "01_85": "autofocus puts the cursor in an input field as soon as the page loads.",
  "01_86": "<nav> marks navigation links semantically for browsers and assistive technology.",
  "01_87": "Semantic elements and ARIA roles help users with assistive tech understand the page.",
  "01_88": "<head> contains metadata, including <title> and <meta>, and comes before <body>.",
  "01_89": "<span> is for inline grouping of text so you can style or script it easily.",
  "01_90": "<div> is a block element by default, meaning it starts on a new line and stretches full width.",
  "01_91": "<br> inserts a line break inside text, pushing what follows onto a new line.",
  "01_92": "action specifies the URL where form data is sent after submission.",
  "01_93": "readonly lets users see but not change the value in an input field.",
  "01_94": "\"dropdown\" is not a valid <input> type; url, date, and file are all valid.",
  "01_95": "<fieldset> groups related form controls and adds a border around them.",
  "01_96": "If you omit a closing <p> tag, browsers try to guess where the paragraph ends, which can lead to unexpected layouts.",
  "01_97": "<link rel=\"icon\" href=\"favicon.ico\"> is the correct syntax for including a favicon in the browser tab.",
  "01_98": "<pre> preserves spaces and line breaks, making it ideal for displaying preformatted blocks of code.",
  "01_99": "<!-- This is a comment --> is the standard HTML comment syntax.",
  "01_100": "<strong> means important content for accessibility, while <b> just bolds text visually.",
  "01_101": "The <source> tag allows you to specify multiple media formats for audio or video, so the browser can pick the first supported one.",
  "01_102": "The <track> tag is used inside <video> or <audio> to provide captions, subtitles, or descriptions for media, improving accessibility.",
  "01_103": "The 'default' attribute on a <track> tag tells the browser to display that track's captions/subtitles unless the user chooses another.",
  "01_104": "The <object> tag is recommended for embedding external resources like PDFs and SVGs, as it allows fallback content and supports more types.",
  "01_105": "<main> defines the central, unique content for the page, distinguishing it from headers, footers, or sidebars.",
  "01_106": "<article> marks up a self-contained, independent piece of content such as a blog post, news story, or forum entry.",
  "01_107": "<aside> is used for content related to but not central to the main content, like sidebars, pull quotes, or additional info.",
  "01_108": "<iframe> embeds another HTML page within the current page, which is useful for displaying external sites, maps, or widgets.",
  "01_109": "<section> is for grouping thematically related content, making the structure of the page clearer for browsers and assistive tech.",
  "01_110": "<nav> is the semantic element for navigation links, helping both users and assistive technologies identify site navigation.",
  "01_111": "The World Wide Web Consortium (W3C) creates and publishes HTML, CSS, and related standards.",
  "01_112": "Inline elements do not cause new lines by default, they flow within line-level text.",
  "01_113": "The <em> tag semantically marks emphasized text and is read appropriately by assistive tech."
}
