{
  "04_01": "SQL stands for Structured Query Language, which is the standard language used to interact with relational databases.",
  "04_02": "The SELECT statement is used to retrieve data from a database table in SQL.",
  "04_03": "The WHERE clause is used to filter records and return only those that meet certain conditions in a SELECT statement.",
  "04_04": "SELECT * FROM users; selects all columns from the users table. The asterisk (*) means 'all columns.'",
  "04_05": "ORDER BY is used to sort the rows returned by a query based on one or more columns.",
  "04_06": "GROUP BY groups rows that have the same values in specified columns, often for aggregation.",
  "04_07": "INSERT INTO students VALUES (...); is the syntax for adding a new row into the students table.",
  "04_08": "DELETE is the SQL keyword used to remove records from a table.",
  "04_09": "The PRIMARY KEY constraint ensures each row in a table is unique and can be reliably identified.",
  "04_10": "UPDATE is used to change existing data in one or more rows of a table.",
  "04_11": "LIKE is an operator used to search for a pattern in a column, often with wildcards.",
  "04_12": "COUNT() returns the number of rows that match a query or the number of non-null values in a column.",
  "04_13": "SELECT DISTINCT returns only unique values from a column, removing duplicates.",
  "04_14": "DROP TABLE removes an entire table and its data from the database permanently.",
  "04_15": "A FOREIGN KEY creates a link between two tables, enforcing referential integrity.",
  "04_16": "SELECT AVG(age) FROM students; calculates the average value of the age column for all rows.",
  "04_17": "LIMIT restricts the number of rows returned by a query.",
  "04_18": "SELECT * FROM students WHERE age > 18; retrieves all students with age greater than 18.",
  "04_19": "JOIN combines rows from two or more tables based on a related column between them.",
  "04_20": "FULL OUTER JOIN returns all records from both tables, with NULLs where there is no match.",
  "04_21": "MAX() is an aggregate function that returns the highest value in a column.",
  "04_22": "VARCHAR(255) is a variable-length character type for storing text up to 255 characters.",
  "04_23": "The NOT NULL constraint ensures that a column must always have a value, never NULL.",
  "04_24": "ALTER is used to change the structure of an existing table, such as adding or removing columns.",
  "04_25": "TRUNCATE removes all rows from a table but keeps its structure for future data.",
  "04_26": "UNION combines the results of two SELECT queries and removes duplicate rows from the result set.",
  "04_27": "HAVING filters groups created by GROUP BY after the grouping and aggregation have taken place.",
  "04_28": "COUNT(column) returns the number of non-null values in the specified column.",
  "04_29": "WHERE filters individual rows before grouping; HAVING filters groups after GROUP BY.",
  "04_30": "IS NULL is used to test whether a column contains a NULL (missing) value.",
  "04_31": "CREATE VIEW creates a virtual table (view) based on the result of a SELECT query.",
  "04_32": "BETWEEN selects values within a given inclusive range, such as BETWEEN 10 AND 20.",
  "04_33": "AS is used to rename a column or table with an alias in the result set."
}
