{
  "02_01": "The <link> tag is used in HTML to connect an external CSS file to the webpage.",
  "02_02": "The font-family property specifies which font to use for an element's text.",
  "02_03": "The id attribute gives a unique identifier to an HTML element, which is important for targeting with CSS or JavaScript.",
  "02_04": "The UPDATE statement is used in SQL to modify existing records in a table.",
  "02_05": "The selector div p targets all <p> elements that are anywhere inside a <div>.",
  "02_06": "The DISTINCT keyword in SQL returns only unique values, removing duplicates from the results.",
  "02_07": "<article> is a semantic HTML5 element for self-contained content such as news or blog posts.",
  "02_08": "The JOIN keyword in SQL combines rows from two or more tables based on related columns.",
  "02_09": "The font-size CSS property changes the size of the text in an element.",
  "02_10": "The DROP keyword in SQL deletes an entire table from the database.",
  "02_11": "The let keyword declares a variable with block scope in JavaScript.",
  "02_12": "JSON.parse() converts a JSON string into a usable JavaScript object.",
  "02_13": "The === operator checks for both value and type equality in JavaScript.",
  "02_14": "typeof null returns 'object' in JavaScript due to a legacy bug.",
  "02_15": "The length property of an array returns the number of elements in the array.",
  "02_16": "The filter method returns a new array with all elements that pass a provided test.",
  "02_17": "In a regular function, this refers to the global object (window in browsers).",
  "02_18": "2 + '2' performs string concatenation, resulting in '22'.",
  "02_19": "setTimeout() delays the execution of a function by a specified number of milliseconds.",
  "02_20": "The return statement outputs a value from a function and ends the function's execution.",
  "02_21": "// is used to start a single-line comment in JavaScript.",
  "02_22": "let a = []; creates an empty array in JavaScript.",
  "02_23": "The pop() method removes the last element from an array.",
  "02_24": "&& is the logical AND operator in JavaScript.",
  "02_25": "'5' == 5 returns true because == does type coercion in JavaScript.",
  "02_26": "The Date object in JavaScript represents dates and times.",
  "02_27": "The push() method adds a new element to the end of an array.",
  "02_28": "const is used to declare a variable whose value cannot be reassigned.",
  "02_29": "break immediately exits a loop or switch statement.",
  "02_30": "NaN stands for 'Not a Number' in JavaScript.",
  "02_31": "typeof undefined returns 'undefined' in JavaScript.",
  "02_32": "A function expression can be written as const myFunc = function() {}.",
  "02_33": "The toString() method converts a number to a string.",
  "02_34": "event.preventDefault() stops the default action of an event in the browser.",
  "02_35": "querySelector('#id') selects an element with a specific ID.",
  "02_36": "The textContent property gets the text inside an HTML element.",
  "02_37": "The forEach() method executes a function once for each array element.",
  "02_38": "You add a property to an object like this: person.age = 25;",
  "02_39": "0 == false returns true because of type coercion with == in JavaScript.",
  "02_40": "After x += 5, the value of x is 15.",
  "02_41": "addEventListener('click', fn) adds a click event listener to a button.",
  "02_42": "Array.isArray(arr) checks if a variable is an array.",
  "02_43": "Destructuring allows you to extract values from arrays or objects easily in ES6.",
  "02_44": "An arrow function is written as let fn = () => {}.",
  "02_45": "The fetch() method is used to send HTTP requests in JavaScript.",
  "02_46": "The finally block runs after try and catch, no matter what.",
  "02_47": "arr[0] accesses the first element in an array.",
  "02_48": "Promise() is used to create a new promise in JavaScript.",
  "02_49": "typeof [1,2,3] returns 'object' because arrays are objects in JavaScript.",
  "02_50": "'Hello'.toLowerCase() returns 'hello'."
}
