{
  "01_01": "HTTP (HyperText Transfer Protocol) is the primary protocol used for transferring web content between clients and servers on the internet.",
  "01_02": "CSS (Cascading Style Sheets) is used to apply styles like color, layout, and fonts to HTML documents.",
  "01_03": "The <a> element is used to create hyperlinks, allowing users to navigate to other pages or resources.",
  "01_04": "The src attribute in an <img> tag specifies the path or URL of the image to be displayed.",
  "01_05": "HTML5 is a markup language that structures web content and defines elements like headings, paragraphs, and links.",
  "01_06": "The <title> element displays text in the browser's title bar or tab, providing a title for the web page.",
  "01_07": "<ol> is the HTML element for creating an ordered (numbered) list.",
  "01_08": "The background-image CSS property sets an image as the background of an element.",
  "01_09": "The padding property controls the space between an element's border and its content.",
  "01_10": "The <br/> element inserts a line break in the text, starting a new line without starting a new paragraph.",
  "01_11": "The color CSS property changes the text color of an element.",
  "01_12": "<br> is an empty element in HTML, meaning it does not have a closing tag and does not contain content.",
  "01_13": "The CSS box model consists of content, padding, border, and margin, in that order from inside to outside.",
  "01_14": "Cascading in CSS refers to the way styles are applied in order of importance, combining rules from different sources and using the most specific one.",
  "01_15": "display: none removes an element from the page and the layout flow, so it takes up no space.",
  "01_16": "The transform property allows you to apply 2D or 3D transformations like rotation, scaling, and skewing to elements.",
  "01_17": "A liquid layout uses percentages for sizing and adapts as the browser window resizes.",
  "01_18": "A liquid layout is a layout type where container sizes are set in percentages, allowing them to resize with the browser window.",
  "01_19": "A key disadvantage of RWD is that all assets, such as images, are downloaded regardless of device size, potentially slowing load times.",
  "01_20": "The hidden property makes elements invisible but does not remove them from the document layout, they still take up space.",
  "01_21": "The float property is used to position elements to the left or right, letting text and inline elements wrap around them.",
  "01_22": "grid-template-columns defines the number and width of columns in a CSS Grid container.",
  "01_23": "Media queries in CSS allow you to apply styles based on conditions like screen width, such as min-width.",
  "01_24": "Adaptive web design uses multiple templates to handle different screen sizes and devices.",
  "01_25": "The block display value causes an element to take up the full width available in its container.",
  "01_26": "grid-row in CSS Grid specifies how many rows an element will span across in the grid layout.",
  "01_27": "The type attribute sets the type of an HTML input, such as 'text', 'password', 'checkbox', etc.",
  "01_28": "rgb(255, 0, 0) is the RGB color notation for red.",
  "01_29": "A descendent selector in CSS, such as p a, selects <a> elements inside <p> elements.",
  "01_30": "<li> is the correct element to use for list items in ordered or unordered lists.",
  "01_31": "The required attribute forces users to fill out a field before submitting a form, often used with number or text inputs.",
  "01_32": "A responsive layout uses media queries to adapt the site's appearance to different device screens.",
  "01_33": "The placeholder attribute gives a hint or example of the expected input inside a text field.",
  "01_34": ".firstParagraph is a class selector, used to style elements with the class 'firstParagraph'.",
  "01_35": "div and p elements are block-level by default, so they start on a new line and take up the full width.",
  "01_36": ".highlight is a class selector, and when written as .highlight, it targets elements with the class 'highlight'.",
  "01_37": "Margin is the CSS property used to create space around the outside of an element's border.",
  "01_38": "The <style> element allows you to write internal CSS rules directly in an HTML page.",
  "01_39": "<ol> is the HTML tag for ordered (numbered) lists.",
  "01_40": "p > a is a child selector that targets <a> elements that are direct children of <p> elements."
}
