{
  "01_01": "The 'npm init' command initializes a new Node.js project and creates a package.json file.",
  "01_02": "The 'require()' method is used to import built-in modules like 'fs' or 'path' in Node.js.",
  "01_03": "Express is a web framework for Node.js.",
  "01_04": "The correct way to create a new Express application is: const app = require('express')().",
  "01_05": "The 'app.listen(3000);' statement starts an HTTP server with Express.",
  "01_06": "The 'res.send()' method sends a response to the client in an Express route.",
  "01_07": "The method 'app.get()' is used to define a route for HTTP GET requests.",
  "01_08": "Static files in an Express app are served with app.use(express.static('public')).",
  "01_09": "The middleware 'express.json()' is used to parse incoming JSON payloads in Express.",
  "01_10": "The global variable '__dirname' gives you the absolute path of the directory containing the current Node.js file.",
  "01_11": "Middleware in Express is a function that runs during request processing.",
  "01_12": "Using app.use((req, res, next) =&gt; { console.log(req.url); next(); }); will log every request made to your server.",
  "01_13": "In Express, req.params.id is used to access a URL parameter from a route like /user/:id.",
  "01_14": "The 'path' module is commonly used for working with file paths in Node.js.",
  "01_15": "The 'module.exports' statement exports values for use in other files.",
  "01_16": "The statement 'app.listen(8080);' will cause the Express server to listen on port 8080.",
  "01_17": "The 'process' object contains information about the current Node.js process.",
  "01_18": "The property req.query gives you query string parameters in Express.",
  "01_19": "The correct way to export a function named add() is: exports.add = add;",
  "01_20": "The statement require('./utils'); is used to require your own file named 'utils.js' in Node.js.",
  "01_21": "Node.js is a JavaScript runtime built on Chrome's V8 engine.",
  "01_22": "The function require() is used to include built-in modules in Node.js.",
  "01_23": "The npm command installs and manages packages for Node.js.",
  "01_24": "The default filename for a Node.js package manifest is package.json.",
  "01_25": "The built-in Node.js module 'fs' is commonly used to work with files."
}
