{
  "04_01": "EJS stands for Embedded JavaScript, a templating language for server-rendered HTML.",
  "04_02": "The &lt;%= %&gt; syntax in EJS is used to output the value of a variable.",
  "04_03": "The &lt;% %&gt; tag lets you run JavaScript code in EJS without outputting anything.",
  "04_04": "EJS template files usually end with the .ejs extension.",
  "04_05": "You can’t include Bootstrap by linking to a .ejs file—Bootstrap is included via CDN or downloading CSS/JS files.",
  "04_06": "btn-primary is the Bootstrap class for a primary-colored button.",
  "04_07": "The &lt;link&gt; tag is used to link CSS files in HTML documents.",
  "04_08": "The col-12 class makes a Bootstrap column span the full width of its parent.",
  "04_09": "In EJS, &lt;%= users[0] %&gt; outputs the first item of the users array.",
  "04_10": "document.getElementById('main') selects an element by its ID in vanilla JavaScript.",
  "04_11": "querySelectorAll() returns a NodeList of elements matching the selector.",
  "04_12": "$('div') in jQuery selects all &lt;div&gt; elements.",
  "04_13": "Use textContent to change the text of an element with vanilla JS.",
  "04_14": "$('button').on('click', ... ) attaches a click handler with jQuery.",
  "04_15": ".addClass() adds a CSS class to the selected elements in jQuery.",
  "04_16": "fetch() is the modern way to get data from APIs in JavaScript.",
  "04_17": "&lt;%= name %&gt; outputs the value of the JavaScript variable name in EJS.",
  "04_18": "The row class in Bootstrap is used to create a horizontal group of columns.",
  "04_19": "JSON.parse() turns a JSON string into a JavaScript object.",
  "04_20": "The defer attribute tells the browser to run the script after the page has loaded.",
  "04_21": ".hide() hides elements with jQuery.",
  "04_22": "The src attribute specifies the source JavaScript file in a &lt;script&gt; tag.",
  "04_23": "innerHTML gets or sets the HTML content of an element in vanilla JS.",
  "04_24": "AJAX lets web pages send and receive data from a server asynchronously.",
  "04_25": "$('.active') gets elements with the class active in jQuery.",
  "04_26": "The submit event occurs when a form is submitted.",
  "04_27": "&lt;% include partial.ejs %&gt; includes a partial template in EJS.",
  "04_28": "To send JSON with fetch(), you set the body and Content-Type header appropriately.",
  "04_29": "text-center centers text horizontally in Bootstrap.",
  "04_30": ".val() gets or sets the value of input fields in jQuery.",
  "04_31": "navbar is the Bootstrap class for a responsive navigation bar.",
  "04_32": "$('div p') selects all &lt;p&gt; elements inside a &lt;div&gt; using jQuery.",
  "04_33": ".remove() deletes elements from the DOM in jQuery.",
  "04_34": ".css() gets or sets CSS properties for elements in jQuery.",
  "04_35": "id is the attribute for unique identification of HTML elements.",
  "04_36": "The Bootstrap grid system arranges content in rows and columns.",
  "04_37": "p-3 adds padding to an element in Bootstrap.",
  "04_38": "Use element.style.backgroundColor to change an element’s background color with vanilla JS.",
  "04_39": "$(document).ready(...) runs code when the DOM has finished loading in jQuery.",
  "04_40": "href is the attribute used in &lt;link&gt; tags to specify the CSS file path."
}
