{
  "02_01": "Proof by contradiction works by assuming the statement is false. If this leads to a logical contradiction, the original statement must be true. For example, to prove √2 is irrational, assume it's rational and show this is impossible.",
  "02_02": "The contrapositive of 'If n is even, then n^2 is even' is 'If n^2 is not even, then n is not even.' Contrapositives are always logically equivalent to the original statement.",
  "02_03": "The intersection A ∩ B is the set of elements in both A and B. Here, both sets share 2 and 3.",
  "02_04": "The symbol ∅ represents the empty set, which contains no elements.",
  "02_05": "The cardinality of a set is the number of elements it contains. P = {a, b, c} has 3 elements.",
  "02_06": "The power set of X = {1,2} is the set of all subsets: {}, {1}, {2}, and {1,2}.",
  "02_07": "The symbol ⊆ means 'is a subset of.' This means every element of one set is in the other.",
  "02_08": "The union of any set A with the empty set ∅ is just A. The empty set adds nothing.",
  "02_09": "The complement of the universal set U is the empty set ∅, since U contains everything.",
  "02_10": "{a, b} is a subset of {a, b, c} because every element in the smaller set is in the larger set.",
  "02_11": "A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C) is an example of the distributive law in set theory.",
  "02_12": "If A and B are disjoint, they share no elements. Their intersection is ∅.",
  "02_13": "x ∈ A means x is an element of set A (for example, 2 ∈ {1,2,3}).",
  "02_14": "Proof by contrapositive proves 'if not Q then not P' instead of 'if P then Q.' This method is logically equivalent.",
  "02_15": "Since 4 is an even number and A is the set of even numbers, 4 ∈ A is true.",
  "02_16": "The identity law for sets says A ∪ ∅ = A and A ∩ U = A. Adding the empty set or intersecting with everything doesn't change the set.",
  "02_17": "A set with n elements has 2^n subsets. For example, with 3 elements: {}, {a}, {b}, {c}, {a,b}, {a,c}, {b,c}, {a,b,c}.",
  "02_18": "A ∩ B' is the area inside A but outside B on a Venn diagram. It's all elements in A that are not in B.",
  "02_19": "To show A = B, you must prove A ⊆ B and B ⊆ A (that they contain exactly the same elements).",
  "02_20": "If A ⊆ B and B ⊆ C, then A ⊆ C. This is the transitive property for subsets.",
  "02_21": "Proof by contradiction means assuming the statement is false, showing this leads to an impossible situation, so the original must be true.",
  "02_22": "∅ is the standard symbol for the empty set, which contains no elements.",
  "02_23": "A ⊆ B if and only if every element of A is also an element of B. Subset means 'all members of A are in B.'",
  "02_24": "The power set of {1, 2} includes all possible subsets: ∅, {1}, {2}, and {1,2}.",
  "02_25": "A set with 4 elements has 2^4 = 16 subsets.",
  "02_26": "Any set A is always a subset of itself (A ⊆ A).",
  "02_27": "{2, 4} is not a subset of {1, 2, 3} because 4 is not in A.",
  "02_28": "The union of any set A with the empty set ∅ is just A. The empty set doesn't add elements.",
  "02_29": "The intersection of any set A and the universal set U is A, since all elements of A are in U.",
  "02_30": "If A ⊆ B and B ⊆ C, then A ⊆ C. This is the transitive property for subsets.",
  "02_31": "A \\ B is the set of elements in A but not in B.",
  "02_32": "DeMorgan's law for sets says (A ∪ B)' = A' ∩ B'.",
  "02_33": "The complement of the universal set U is the empty set ∅, because U contains everything.",
  "02_34": "Proof by contradiction assumes the opposite of what you want to prove, shows this leads to a contradiction, and therefore the original must be true.",
  "02_35": "A = {x ∈ N | x < 3} means all natural numbers less than 3, so A = {1, 2}.",
  "02_36": "The empty set is a subset of every set, because there is no element in ∅ that isn't in any other set.",
  "02_37": "If sets are disjoint, their intersection is empty: A ∩ B = ∅.",
  "02_38": "The cardinality of {1,2,3,4,5} is 5 because it contains 5 elements.",
  "02_39": "An existence proof shows something exists by providing an explicit example.",
  "02_40": "A ∩ B means the elements that are in both sets. Both sets contain 2 and 3, so A ∩ B = {2,3}."
}
