{
  "01_01": "A program is a sequence of instructions that the computer hardware follows step by step to accomplish a task. The other options describe parts of computing but not what a program is.",
  "01_02": "Software isn't just the program code-it's also the data the program uses. This combination allows the computer to actually do something useful.",
  "01_03": "The CPU is called the 'brain' because it actually performs the instructions written in software. It reads, interprets, and executes code.",
  "01_04": "I/O devices are things like the keyboard, mouse, or monitor that let you interact with the computer. Without them, you couldn't give commands or see results.",
  "01_05": "Main memory (RAM) temporarily holds both the program and its data while the CPU works. If the power is turned off, all this data is lost.",
  "01_06": "Secondary memory, such as hard drives or SSDs, keeps your files and programs saved even when your computer is off. RAM, by contrast, is erased when the power goes out.",
  "01_07": "The operating system is a program that manages the computer's hardware resources and provides the interface you see. It makes sure different programs and devices can work together.",
  "01_08": "An application is any software you use to do a task-like a web browser or a game-that isn't the operating system itself.",
  "01_09": "Analogue systems, like old thermometers, represent values as a smooth, continuous range rather than in fixed steps. This is the opposite of digital systems.",
  "01_10": "Digital systems break information into small pieces (like binary numbers) and represent each piece with numbers, not a smooth range.",
  "01_11": "A bit is the smallest unit of data in computing-just a 0 or a 1. Larger values are made by grouping several bits together.",
  "01_12": "Binary numbers are base 2, meaning they only use the digits 0 and 1. This matches how computers use switches (on/off) to store information.",
  "01_13": "Computer architecture is all about how the physical parts of a computer are arranged and how they interact, not about instructions or memory alone.",
  "01_14": "A bus is like a data highway that lets components of the computer send information to each other quickly and efficiently.",
  "01_15": "Controllers are special devices that handle communication between the main computer and things like disks or printers, ensuring each device works correctly.",
  "01_16": "Addresses in memory work like street addresses-they uniquely identify each spot in memory so the CPU can find and use the data it needs.",
  "01_17": "A byte contains 8 bits, which is enough to represent a number from 0 to 255 or a single ASCII character. This became the standard size for efficient processing.",
  "01_18": "Volatile memory, like RAM, loses all its stored data when the power is turned off. That's why you need to save your work before shutting down.",
  "01_19": "Cache is a small, fast memory between the CPU and RAM. It holds frequently used data so the CPU doesn't have to keep fetching it from slower main memory.",
  "01_20": "A ROM chip stores the BIOS, which is critical for starting up your computer. ROM keeps its data even when the computer is powered off.",
  "01_21": "A network connects computers together so they can share information and resources. Even just two computers can form a network.",
  "01_22": "A network address uniquely identifies a computer on a network, making sure data sent over the network reaches the right device.",
  "01_23": "A point-to-point connection is a direct wire between two computers. This type of link allows them to communicate privately and quickly.",
  "01_24": "In networking, large messages are split into packets to make transmission more reliable and efficient. Each packet can travel a different path if needed.",
  "01_25": "A LAN (local area network) connects computers over a short distance, like in one building. This is different from a global or wide-area network.",
  "01_26": "The Internet is a massive network made up of many smaller networks (WANs and LANs) connected together around the world.",
  "01_27": "A protocol is a set of agreed-upon rules that allow computers to understand each other when communicating over a network.",
  "01_28": "An IP address is a number assigned to every computer on the Internet so that data can find its way to the correct machine.",
  "01_29": "A URL (Uniform Resource Locator) is the address you type in a browser to access a specific page or resource on the web.",
  "01_30": "URL stands for Uniform Resource Locator, describing the standardized format for web addresses.",
  "01_31": "A programming language is a system of rules for writing code that a computer can execute. It defines how instructions are written and understood.",
  "01_32": "A class in Java is like a blueprint for creating objects. It defines what properties and behaviors those objects will have.",
  "01_33": "A Java method is made up of statements and expressions. It's the place where you write the code that actually gets executed.",
  "01_34": "A statement in Java performs an action or operation, like assigning a value or calling a function. It's the basic unit of work in your code.",
  "01_35": "A statement performs an action but doesn't produce a value on its own. For example, an assignment or a print command is a statement, not an expression.",
  "01_36": "The Java API is a library of built-in tools and features that make writing Java programs easier and more powerful.",
  "01_37": "Every Java program needs a main method because that's the entry point the Java Virtual Machine looks for when starting the program.",
  "01_38": "Identifiers in Java are the names you give to things like variables, classes, or functions. They help you refer to those things in your code.",
  "01_39": "Java requires the main method to include 'public static void' so that the JVM knows where to start running the program.",
  "01_40": "Machine language uses binary (0s and 1s), which is what the hardware can actually read and execute directly-unlike higher-level languages.",
  "01_41": "Assembly language uses human-readable abbreviations for machine instructions, making it easier to program hardware than with pure binary.",
  "01_42": "Java is a high-level language, meaning it lets you write instructions in English-like phrases instead of raw binary or assembly.",
  "01_43": "Fourth-generation languages provide even higher abstraction and automation than high-level languages, often making coding faster and simpler.",
  "01_44": "A compiler translates your written code into machine language or bytecode so the computer can execute it. Interpreters run code line by line, but compilers do the whole program at once.",
  "01_45": "Java compiles code into bytecode, which can run on any computer with a Java Virtual Machine (JVM). This makes Java highly portable.",
  "01_46": "Interpreters read code and translate it into actions as the program runs, instead of converting everything ahead of time like a compiler.",
  "01_47": "Java is object-oriented, meaning you design your code using objects and classes to model real-world things and their interactions.",
  "01_48": "Encapsulation means that Java objects control their own data, keeping details private and only letting the outside world interact in specific ways.",
  "01_49": "Polymorphism lets you use objects of a subclass wherever a parent class is expected, which makes code more flexible and reusable.",
  "01_50": "Java classes can inherit from only one parent class to avoid confusion and complexity (known as single inheritance).",
  "01_51": "Good programming starts with understanding the problem, then designing a solution, and finally testing it to make sure it works.",
  "01_52": "The domain of a problem is all the information needed to fully understand what's being asked so you can solve it correctly.",
  "01_53": "A valid Java identifier must start with a letter, underscore, or dollar sign-not a digit-to avoid confusion with numbers.",
  "01_54": "Identifiers in Java can't start with a digit; otherwise, the compiler might think it's a number instead of a name.",
  "01_55": "There's no strict maximum length for Java identifiers, but long names can make code harder to read. Clarity is more important than length.",
  "01_56": "Java uses camelCase for variable names-start with a lowercase letter, capitalize new words after that (like: myVariableName).",
  "01_57": "Java identifiers can use letters, numbers, underscores, and dollar signs-but not spaces or most special characters.",
  "01_58": "The ALU (Arithmetic Logic Unit) is the part of the CPU that does basic math and logic tasks, like adding numbers or comparing values.",
  "01_59": "The CPU fetches data and instructions from main memory, decodes them, and executes them, repeating this process millions of times per second.",
  "01_60": "Cache memory is small but extremely fast, sitting close to the CPU so it can store and quickly access the most-used data.",
  "01_61": "Parallel processing means each processor core can handle its own instructions at the same time, making computers much faster for certain tasks.",
  "01_62": "In Java, a class acts as a template for creating objects, each of which can have its own values and behaviors based on the class definition.",
  "01_63": "Inheritance lets one Java class get the properties and methods of another, allowing for code reuse and easier updates.",
  "01_64": "Polymorphism means using an object as if it were its parent class. Overloading or multiple inheritance are different concepts.",
  "01_65": "Comments are meant for humans who read the code; they help explain what the code does or why something is written a certain way, making programs easier to understand and maintain.",
  "01_66": "A valid single-line comment in Java begins with //, which tells the compiler to ignore everything after the slashes on that line.",
  "01_67": "The int type is ideal for counting discrete things like students, as it stores whole numbers without decimals, which matches how we count people.",
  "01_68": "System.out.println() is Java's standard method to print a line of text to the console. The other options are from different languages or are incorrect in Java.",
  "01_69": "Syntax is the set of rules that tells us how to write statements and expressions correctly in a programming language, ensuring the computer can interpret our code."
}
