{
  "06_01": "An encoder converts active input signals into a coded binary output, reducing the number of lines required to represent multiple signals.",
  "06_02": "Encoders always have fewer output lines than input lines because they compress multiple inputs into a smaller binary code.",
  "06_03": "A 4-to-2 binary encoder has 4 inputs and produces 2 binary output lines, since 2 bits can represent 4 combinations.",
  "06_04": "A priority encoder outputs the binary code of the highest-priority active input, ignoring lower-priority ones.",
  "06_05": "A decimal-to-binary encoder can convert keypad or decimal switch inputs into binary form for processing.",
  "06_06": "Encoders reduce output lines, can use priority logic, may work with decoders, and are often used in communication systems.",
  "06_07": "A decoder performs the reverse of an encoder by taking a binary code and activating one corresponding output line.",
  "06_08": "A 3-to-8 decoder uses 3 input lines to produce 8 unique output lines, each representing one binary combination.",
  "06_09": "An 'enable' input activates the decoder's outputs; without it, all outputs remain inactive.",
  "06_10": "Decoders are used for memory address decoding, seven-segment display control, and CPU instruction decoding.",
  "06_11": "A 2-to-4 decoder can be built with basic AND, OR, and NOT gates to generate four unique outputs.",
  "06_12": "A multiplexer selects one input from many and forwards it to a single output line based on select signals.",
  "06_13": "In a multiplexer, select lines determine which input is connected to the output.",
  "06_14": "Multiplexers can implement logic functions by routing inputs according to select line combinations.",
  "06_15": "Multiplexers reduce required data lines, are used in data routing, and rely on select lines to choose inputs.",
  "06_16": "A demultiplexer performs the opposite function of a multiplexer by sending a single input to one of many outputs.",
  "06_17": "A demultiplexer takes one input and sends it to a selected output based on control select lines.",
  "06_18": "Demultiplexers are used for serial-to-parallel conversion, data distribution, and memory chip selection.",
  "06_19": "A 1-to-4 demultiplexer needs 2 select lines to choose among 4 outputs (2^2 = 4).",
  "06_20": "Multiplexers and demultiplexers can be paired to enable bidirectional communication over a single channel.",
  "06_21": "The 74xx series of digital ICs is commonly used to build multiplexers in logic circuits.",
  "06_22": "Cascading multiplexers allows larger devices to be built from smaller ones by adding select lines.",
  "06_23": "Multiplexers enable sharing of a single communication line among multiple signals in digital systems.",
  "06_24": "Decoders are widely used in address decoding to select specific memory locations.",
  "06_25": "Decoders lack a data input, while demultiplexers have one; both use inputs to control output activation.",
  "06_26": "Encoders are used at the input stage to compress signals; decoders are used at the output stage to expand them.",
  "06_27": "Error detection is not a common application for priority encoders, which are typically used for interrupts and keyboard encoding.",
  "06_28": "A 4-to-16 decoder requires 4 input lines to produce 16 unique outputs.",
  "06_29": "Decoder enable inputs allow parallel connection, can disable outputs, and control device activation.",
  "06_30": "A demultiplexer can act as a decoder if its data input is fixed, making it select outputs only based on control inputs.",
  "06_31": "A multiplexer selects one of many inputs to share a single output channel, enabling efficient signal routing.",
  "06_32": "Decoder outputs are mutually exclusive; only one output is active at a time based on the input code.",
  "06_33": "The formula inputs = 2^n defines the relationship between select lines (n) and the number of multiplexer inputs.",
  "06_34": "Multiplexers are used in combinational logic, CPU data routing, and communication signal selection.",
  "06_35": "Multiplexers are key components in time-division multiplexing, allowing multiple signals to share a channel over time.",
  "06_36": "A demultiplexer routes a single input to one of many outputs based on select line signals.",
  "06_37": "A 3-to-8 decoder can be implemented with only NAND gates by combining them in the proper logic configuration.",
  "06_38": "Multiplexers are often used to select between analog signals before conversion to digital form.",
  "06_39": "Priority encoders assign priority to inputs, ignore lower-priority active inputs, and are common in interrupt systems.",
  "06_40": "The multiplexer output always matches one of its selected inputs; it does not alter the data.",
  "06_41": "A decoder's outputs are calculated using outputs = 2^n, where n is the number of inputs.",
  "06_42": "A demultiplexer requires both a data input and select lines to choose the active output.",
  "06_43": "Encoders and decoders are paired in communication systems for data compression, reconstruction, and keyboard processing.",
  "06_44": "Encoders do not always require an enable input; it depends on the design.",
  "06_45": "Both multiplexers and decoders use select lines to determine outputs or inputs.",
  "06_46": "A multiplexer cannot function as a demultiplexer without modification because their control logic differs.",
  "06_47": "Multiplexers can be configured to implement logic gates, arithmetic circuits, and signal selectors.",
  "06_48": "A demultiplexer is not identical to a decoder; the demultiplexer requires data input, while the decoder does not.",
  "06_49": "A priority encoder is ideal for CPU interrupt handling because it resolves simultaneous requests by priority.",
  "06_50": "Selectors and multiplexers perform the same role in routing one of many inputs to a single output."
}
