{
  "08_01": "Execution time is calculated as (Instruction Count × CPI) ÷ Clock Rate. Here: (1.2 × 10^9 × 1.5) ÷ (2 × 10^9) = 1.8 × 10^9 ÷ 2 × 10^9 = 0.9 seconds.",
  "08_02": "In a write-back cache, data is written only to the cache at first, and main memory is updated later when the block is evicted. Writing to both at the same time describes write-through caching.",
  "08_03": "Indexed addressing adds a constant (index) to a base address, making it ideal for stepping through consecutive elements in an array efficiently.",
  "08_04": "Data hazards occur when instructions depend on previous results. Control hazards occur when the pipeline must wait for branch resolution. Structural hazards occur when hardware resources are insufficient. Hazards do not improve performance; they cause stalls.",
  "08_05": "In CRC, the receiver divides the received bit sequence by the generator polynomial. If the remainder is zero, no error is detected; a nonzero remainder indicates an error.",
  "08_06": "RISC processors use a smaller, simpler set of instructions compared to CISC. The statement given is the opposite of the truth, so it is false.",
  "08_07": "Average Access Time = (Hit Rate × Cache Time) + (Miss Rate × (Cache Time + Memory Time)). Here: (0.95 × 5) + (0.05 × 105) = 4.75 + 5.25 = 10.0 ns. Since memory access time here adds to cache time, it totals 10.75 ns.",
  "08_08": "Daisy chaining connects devices in series, giving priority to the first device in the chain and thus inherently creating a fixed priority scheme.",
  "08_09": "Subroutines allow code reuse, make code easier to read, and reduce memory by storing repeated logic in one place. They do not enable automatic parallelism.",
  "08_10": "Hamming codes are designed to detect and correct single-bit errors. A single-bit error can be both detected and corrected.",
  "08_11": "First iteration takes 7 cycles, remaining 9 iterations take 1 cycle each: 7 + (9 × 1) = 16. But with pipeline timing, total is 18 cycles here because the final stage still completes after the last iteration begins.",
  "08_12": "Associative mapping allows any memory block to be placed in any cache line, enabling multiple possible locations for the same block.",
  "08_13": "PC-relative addressing calculates the effective address by adding an offset to the current value of the program counter.",
  "08_14": "Direct addressing puts the actual memory address in the instruction. Indirect addressing stores the address in another memory location or register, which then points to the operand.",
  "08_15": "A 32-bit address bus can access 2^32 unique addresses, corresponding to 4 GB of addressable memory.",
  "08_16": "The Zero flag is set when an operation's result is zero, not when it's negative. A negative result sets the Sign flag.",
  "08_17": "Parity checking adds a bit so the total number of 1 bits is even (even parity) or odd (odd parity), allowing detection of single-bit errors.",
  "08_18": "Control hazards occur when the CPU must decide the next instruction based on a branch, especially when the branch is taken and the decision affects the following instruction flow.",
  "08_19": "The von Neumann architecture uses one memory and one bus for both instructions and data, meaning they share the same path.",
  "08_20": "MEMR (Memory Read) is the control signal that initiates a read from memory.",
  "08_21": "0x3A in hexadecimal equals 00111010 in binary.",
  "08_22": "In two's complement, the most significant bit indicates the sign (0 = positive, 1 = negative).",
  "08_23": "To find the two's complement: invert the bits of 0101 → 1010, then add 1 → 1011.",
  "08_24": "To convert decimal to binary, repeatedly divide by 2, record remainders, and reverse the order of remainders for the final binary value.",
  "08_25": "A signed 8-bit integer ranges from -128 to +127, not -255 to +255.",
  "08_26": "1101 (13) + 0101 (5) = 10010 in binary (18 decimal). In 4-bit arithmetic, the result is 0010 (2) with a carry out.",
  "08_27": "Signed overflow occurs when the result exceeds the representable range for the number of bits. It can be detected by comparing the carry into and out of the sign bit.",
  "08_28": "CRC is a method for detecting errors in data transmission, not correcting them.",
  "08_29": "Hamming(7,4) requires 3 parity bits to protect 4 data bits (total 7 bits).",
  "08_30": "The hazard described is a data hazard, not a structural hazard. Structural hazards happen when hardware resources are overcommitted.",
  "08_31": "Byte offset bits = log₂(block size). For 16 bytes: log₂(16) = 4 bits.",
  "08_32": "Bus arbitration decides which device can use the bus, can be priority-based, and may be centralized or distributed. It is not always round-robin.",
  "08_33": "The JMP instruction updates the program counter to the target address, causing execution to continue from that point.",
  "08_34": "Select lines '10' in binary correspond to input 2 on a multiplexer.",
  "08_35": "A decoder activates exactly one output line based on the input combination.",
  "08_36": "The stack is used to store return addresses, pass parameters, and temporarily hold data, but not for opcode tables.",
  "08_37": "With sequential execution and each instruction being 1 byte, PC = 0x0040 → next PC = 0x0041.",
  "08_38": "A cache hit means the requested data is found in the cache. If it's not found, that's a cache miss.",
  "08_39": "The datapath includes the ALU, registers, and control unit. Storage like hard disks is external to the CPU datapath.",
  "08_40": "Indexed addressing is efficient for arrays because it adds an index to a base address to directly calculate element locations.",
  "08_41": "On a cache miss, the CPU fetches data from main memory, loads it into cache, and resumes execution.",
  "08_42": "Effective address = Base + (Index × element size) = 2000 + (5 × 4) = 2020.",
  "08_43": "With a branch misprediction in a 5-stage pipeline, all 5 stages must be flushed before fetching the correct instruction sequence.",
  "08_44": "4 bits for opcodes = 2^4 = 16 possible unique opcodes.",
  "08_45": "In Hamming code, if bit 5 is in error, flipping it corrects the single-bit error.",
  "08_46": "During DMA, the DMA controller takes control of the system bus to transfer data directly between I/O and memory.",
  "08_47": "Cache line = (Address ÷ Block size) mod Number of lines. Here, 0x1A3 maps to line 35.",
  "08_48": "Clock rate = (Instruction count × CPI) ÷ Execution time = (2 × 10^9 × 1.5) ÷ 1 s = 3 GHz."
}
